NBIAdapter/NBIAdapter/src/test/java/com/btireland/talos/mygroup/myproject/soap/ExampleSoapEndpointTest#receiveAcceptNotificationWithValidationError.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:v1="http://talos.btireland.com/examplews/schemas/v1">
    <soapenv:Header/>
    <soapenv:Body>
        <v1:NOTIFICATION><!--Youmayenterthefollowing2itemsinanyorder-->
            <v1:HEADER>
                <v1:DATA_CONTRACT>100100200</v1:DATA_CONTRACT>
                <v1:ORIGINATOR_CODE>SKY</v1:ORIGINATOR_CODE>
                <v1:TRANSACTION_ID>2342</v1:TRANSACTION_ID>
                <v1:DATE_TIME_STAMP>2020-01-23T23:12:55</v1:DATE_TIME_STAMP>
            </v1:HEADER>
            <v1:NOTIFICATION_DATA>
                <v1:NAME>test</v1:NAME>
                <v1:CODE>RR</v1:CODE>
                <v1:ORDER_NUMBER>200</v1:ORDER_NUMBER>
                <v1:CIRCUIT_DETAILS>
                    <v1:CIRCUIT_ID>002</v1:CIRCUIT_ID>
                    <v1:ACTION_FLAG>P</v1:ACTION_FLAG>
                    <v1:ADDITIONAL_SERVICES>
                        <v1:SERVICE_DETAILS>
                            <v1:SERVICE_NAME>BB</v1:SERVICE_NAME>
                            <v1:SERVICE_VALUE>1G</v1:SERVICE_VALUE>
                            <v1:ACTION_FLAG>P</v1:ACTION_FLAG>
                        </v1:SERVICE_DETAILS>
                    </v1:ADDITIONAL_SERVICES>
                </v1:CIRCUIT_DETAILS>
            </v1:NOTIFICATION_DATA>
        </v1:NOTIFICATION>
    </soapenv:Body>
</soapenv:Envelope>